/**
 * 判断一个 9x9 的数独是否有效。只需要根据以下规则，验证已经填入的数字是否有效即可。

数字 1-9 在每一行只能出现一次。
数字 1-9 在每一列只能出现一次。
数字 1-9 在每一个以粗实线分隔的 3x3 宫内只能出现一次。


上图是一个部分填充的有效的数独。

数独部分空格内已填入了数字，空白格用 '.' 表示。

示例 1:

输入:
[
  ["5","3",".",".","7",".",".",".","."],
  ["6",".",".","1","9","5",".",".","."],
  [".","9","8",".",".",".",".","6","."],
  ["8",".",".",".","6",".",".",".","3"],
  ["4",".",".","8",".","3",".",".","1"],
  ["7",".",".",".","2",".",".",".","6"],
  [".","6",".",".",".",".","2","8","."],
  [".",".",".","4","1","9",".",".","5"],
  [".",".",".",".","8",".",".","7","9"]
]
输出: true
示例 2:

输入:
[
  ["8","3",".",".","7",".",".",".","."],
  ["6",".",".","1","9","5",".",".","."],
  [".","9","8",".",".",".",".","6","."],
  ["8",".",".",".","6",".",".",".","3"],
  ["4",".",".","8",".","3",".",".","1"],
  ["7",".",".",".","2",".",".",".","6"],
  [".","6",".",".",".",".","2","8","."],
  [".",".",".","4","1","9",".",".","5"],
  [".",".",".",".","8",".",".","7","9"]
]
输出: false
解释: 除了第一行的第一个数字从 5 改为 8 以外，空格内其他数字均与 示例1 相同。
     但由于位于左上角的 3x3 宫内有两个 8 存在, 因此这个数独是无效的。
说明:

一个有效的数独（部分已被填充）不一定是可解的。
只需要根据以上规则，验证已经填入的数字是否有效即可。
给定数独序列只包含数字 1-9 和字符 '.' 。
给定数独永远是 9x9 形式的。
*/

/**
 * 注意事项：
 * 数独中出现数字的范围是1~9
 */

/**
 * 解法一：16ms(86%)
 * 暴力法：检查每行，每列，每方格内元素是否重复
 * 不需要使用哈希表，直接使用数组即可，长度已知
 */
class Solution {
public:
    bool isValidSudoku(vector<vector<char>>& board) {
        for(int i=0;i<9;i++){
            vector<int> v(9,0);
            for(int j=0;j<9;j++){
                if(board[i][j]!='.'){
                    if(v[board[i][j]-'1']==1) return false;
                    else{
                        v[board[i][j]-'1']=1;
                    }
                }
            }
        }
        for(int i=0;i<9;i++){
            vector<int> v(9,0);
            for(int j=0;j<9;j++){
                if(board[j][i]!='.'){
                    if(v[board[j][i]-'1']==1) return false;
                    else{
                        v[board[j][i]-'1']=1;
                    }
                }
            }
        }
        for(int ri=0;ri<3;ri++){
            for(int ci=0;ci<3;ci++){
                vector<int> v(9,0);
                for(int i=0;i<3;i++){
                    for(int j=0;j<3;j++){
                        if(board[ri*3+i][ci*3+j]!='.'){
                            if(v[board[ri*3+i][ci*3+j]-'1']==1) return false;
                            else{
                                v[board[ri*3+i][ci*3+j]-'1']=1;
                            }
                        }
                    }
                }
            }
        }
        return true;
    }
};